namespace ServerPlatform
{
    /*
     *  ===========================================================================
     *  작성자     : @yoon
     *  최초 작성일: 2025.05.14
     *  
     *  < 목적 >
     *  - ServerPlatform에서 사용되는 Agent들의 생성과 종료, 명령 인수/인계를 관리한다.
     *  
     *  < TODO >
     *  - 
     *  
     *  < History >
     *  2025.05.14 @yoon
     *  - 최초 작성
     *  ===========================================================================
     */

    internal class AgentManager
    {

    }
}
